{
  "authors": ["Donald Trump 2024"],
  "date": "2024-10-23",
  "context": "Campaign rally in Duluth, Georgia",
  "content": [
    {"author":  "Donald Trump 2024",
    "content":  "DONALD TRUMP: Thank you very much and hello Duluth, hello Duluth, and a very special hello to Georgia. And I’m hearing our numbers are very, very good. There’s a rumor, there’s a rumor out there. We’re doing well, thank you very much, and I’m thrilled to be back in this incredible state with thousands of proud, hard-working American patriots, which is what you are. And I’d like to begin by asking a very simple question. Are you better off now than you were four years ago? That was a very unanimous question. The answer is no. By any standard, the answer is no, and I’m here today with a message of hope for all Americans. With your vote in this election, I will end inflation, I will stop the invasion of criminals into our country, and I will bring back the American dream. I’m going to bring it back very quickly. Our country is being destroyed and crippled by Kamala Harris. A person that got no votes, no votes, therefore she’s a threat to democracy. But together we’re going to fix our nation, and we’re going to fix our nation fast. With your support on November 5th, America will be bigger, better, bolder, richer, safer, and stronger than ever before. This election is a choice between whether we will have four more years of incompetence, failure, and disaster, or whether we will begin the four greatest years in the history of our country. After all the catastrophes she has caused, Kamala Harris can’t say one thing that you’d do differently. You saw that. What would you do differently? I can’t think of anything. This is the worst president in the history of our country, and the worst vice president in the history of our country. And wrong track just came out. Eighty-nine percent wrong track. I want to know, who are the 11 percent? Who are they? Where are they? I’m asking you to be excited about the future of our country again. This will be America’s new golden age. And remember, every problem facing us can be solved, but now the fate of our nation is in your hands. In Georgia, you have to stand up and you have to tell Kamala Harris that, 'Kamala, you’ve done a horrible job. You’re the worst ever. There’s never been anybody like you. You can’t put two sentences together. The world is laughing at us because of you and Crooked Joe. Kamala, you’re fired. Get out. Get out. Get out. You’re fired.' Two days ago, I was in Western North Carolina, where I witnessed the terrible devastation of Hurricane Helene, and I was here in Georgia with your governor a few weeks ago. He’s doing a good job, by the way. Very good job. Thank you. To every family who has lost a loved one or home in that terrible storm, our hearts are with you and we are praying for you.\n\nThe polls, despite everything, the polls, do you see what’s happening here? Here, Alabama, Florida, South Carolina, Tennessee, and Georgia, the polls are through the roof, but what’s better than that? The early voting is, people have never seen anything like it. They’ve never seen anything like it, because the American people are fed up with the people that are leading us down a road to disaster. So the polls are open for early voting in Georgia every day from now till November 1st. You’ve got to get out there and vote, but most importantly, just vote, whichever way you want to do it. I’ve been one that says, whichever way, just get out and vote. Be a little careful. Make sure your vote gets counted. There are ways of doing that, too. With your help, 13 days from now, we’re going to win Georgia. We’re going to defeat Kamala Harris, and we are going to make America great again. Thank you. What a nice crowd this is. What a nice crowd. If Kamala gets four more years, she will obliterate our economy, kill millions of jobs, and destroy your family finances forever. They’re destroying our country. They’re destroying our country. It’s not even possible that they can be doing what they’re doing to our country. They’re either really bad people. They don’t have a clue. Maybe they’re stupid people. But you know what? I’ll tell you. Or maybe they just want to get extra voters. Nobody really knows the answer. But just from a common sense, you know, we are the party of common sense. And from a common sense standpoint, how can they be doing what they’re doing? Kamala’s inflation nightmare has already cost the typical family over $30,000 in higher prices, and now she wants to raise typical family taxes by nearly $3,000 a year. She has no idea. Did you see her today? She was asked kindergarten-type questions by MSDNC. She was unable to answer them. But the best is 60 Minutes. They changed her answer. Should I sue them? Should I sue? Should we sue 60 Minutes and CBS? No, think of it. They asked her a question on 60 Minutes, which is news. You know, these companies have to get licensed. And in the licensing, it says they have — licensing says they have to be — they have to be honest. They gave her a question. She gave an answer that was from a loony bin. They said, “We can’t have that.” They took the answer out in its entirety, threw it away, and they put another answer in. And I think it’s the biggest scandal in broadcasting history. That’s what I think. Taxation interference fraud. The tax queen — because that’s what she was called. She loves taxes. This is the only person I’ve ever seen she campaigns on, “We will raise your taxes.” All my life, I’ve watched politics, and everybody’s saying, “We will cut your taxes, cut your — ” she says she’s going to raise your taxes. The tax queen is also demanding a shocking 33 percent tax hike on all domestic production, along with the largest capital gains tax on unrealized gains — unrealized. In the history of our country, it’s really a confiscation of your property. It will crash the stock market and decimate your 401Ks, but we’ll have a 1929-type depression. This woman is crazy. Take a look at this. Joe Biden and I are about to get rid of that tax bill, calling for a full repeal of President Trump’s tax cuts. If Kamala Harris is elected president, there are many different tax policies which could cripple the economy. “What we need to do is allow these Trump tax cuts to expire.” Even the New York Times admits that 85 percent of the middle class got a tax cut. Americans will face a hike.\n\nTax Foundation finding that a couple with two kids making $165,000 a year would have to pay over $2,400 more in taxes. “And on day one, I will repeal that tax bill.” Joe Biden and I are about to work to get rid of that tax cut. Joe and I are about to get rid of that tax bill. Joe Biden and I are about to get rid of that tax cut. Everything from a 70 to 80 percent tax rate. I think that’s fantastic. We’ve got to increase the corporate tax rate. Part of that is going to be about repealing that tax bill that they just passed. And also looking at estate taxes that are going to have to go up. We will tax capital gains. But we’re going to have to raise corporate taxes. Taxing unrealized gains just doesn’t seem fair in any sense of the word. When the value of your home goes up, you pay higher taxes even if you don’t sell your home. The value of your home never moves the way a stock moves to say, “We’re going to tax what you don’t have.” That’s a sore point. And it’s a big deal. Is that something you think she firmly believes in? I think it’s part of the proposals of the campaign.\n\nUnder my plan, there will also be a carbon fee. There has to be some connection between the fee and bad behaviors. And there has to be, in that we have to monitor whether it’s going to be passed on to consumers. But I’m going to tell you that should never be the reason not to actually put a fee, in particular, a carbon fee. Kamala Harris is also pushing the largest small business tax hike in history. Your businesses are just going to go to other countries. That’s all that’s going to happen. We brought it down to the lowest level we’ve ever had, and they’re going to just drive everybody out. That means the jobs are going to be included. And she wants to massively increase the death tax or the inheritance tax, as it’s known, some quarters, which we eliminated in the Trump tax cuts. You know, we eliminated the inheritance tax on small businesses and family farms. And such a big thing. You know, a farmer has a little beautiful farm. The kids grow up in the farm. They’re getting a little older. They signed their will. If they love their kids, not everybody does. But if they love their kids, listen to this. But if they don’t, don’t worry. Just go to sleep for about 30 seconds. So what happens is they leave it. And they what happened before me is they would lose their farms because the tax would be very substantial, like 52 percent. And they couldn’t pay. So they go to the bank, the friendly banker. They’d borrow the money. They put it against the farm. And within two years, the farm was gone and everybody was crying and it was a disaster. I got rid of it. I got rid of it. There’s no more estate tax. There’s no more estate tax on your beautiful family farm. And there’s no or small business. And that’s a big deal. And they want to end that. They don’t want that. They don’t like that. They want you to pay a nice big tax and destroy your lives. We’re joined tonight by Michael Bellaman, president of the Associated Builders and Contractors, represent over 23,000 small businesses and construction companies. And as a builder, I am very honored to receive their endorsement. They gave me a unanimous endorsement today. Thank you very much. Thank you. Thank you. That’s a great honor. And we were also endorsed by, unanimously, the Border Patrol, unanimously. And I say modestly, they said he’s the greatest president we’ve ever had and the strongest on the border. They said, it’s not possible to be stronger. We added down to the lowest level in history. Oh, by the way, should we drop my favorite chart in the entire world? I love it. Drop that chart, please. Drop it. Let’s see. We’re going to. Oh, there it is. I was looking at me. I started looking at me and I’m looking. I do not like to wear. I don’t like my hair tonight. I started looking at me, but I’d rather look at the chart. I wouldn’t be here if it wasn’t for that chart, right? I wouldn’t be here, but if you notice the arrow on the bottom, I take it to bed every night and I kiss it, roll it up and just kiss it. See the arrow on the bottom? That is the day I left office. Look what happened after that. What they’ve done to our country is unbelievable. And that includes human trafficking, which is mostly in women. You know, they lost three hundred and twenty five thousand children in the last three and a half years. Think of that. That’s your biggest stadium filled up many, many times. Three hundred and twenty five thousand. They’re either dead, they’re sex slaves or they’re slaves, but they’re missing. Most of them never to be seen again. This is under their open border, horrible, horrible policy. And nobody talks about it. The fake news. Look at all of them back there. Look at all of them. That’s a lot. That’s a lot of fake news. The fake news won’t talk about it. I’ve never seen, you know, three hundred and twenty five thousand children gone. They’re gone. The fake news doesn’t write stories about it.\n\nThey don’t talk about it. And even when I put up like we’re going to see a couple of videos tonight, they never put the camera on the video. A friend of mine calls me, “Oh, I love watching you on television. But when you put up videos and they’re important videos and instructive and they teach you what the hell is going on, the camera can’t move their damn little camera like this.” It’s just like a piece of steel. And we say, “Move your camera.” They won’t do it because the executives back in New York and in California said, “Oh, move that camera.” You know, the camera operator doesn’t want to move it, but wants to keep his job. Can you believe it? They won’t move the camera. So you won’t see at home. I’m sorry to tell you. You won’t see it. You won’t see it. Horrible.\n\nSo when you look at that, that was the best we had had and it was going better. We had it done. The border was the most secure it ever was. And then they came in. They got rid of remain in Mexico. That’s pretty good. Right. Remain in Mexico. Wasn’t easy either. It was remain in Mexico. When I said to the president of Mexico is a good guy, he’s a socialist, but that’s okay. These are minor details. But I said, “Listen, President, we want everybody to remain in Mexico before they come in. We want to check them out before they come in, Mr. President.” He laughed at me. He said, “That’s so funny. Why would we have to do that?” I said, “You’re going to do it 100 percent. You’re going to do it 100 percent.” “No, no, no, we cannot do that. We’re not going to. Why would we do a thing like that? That’d be hundreds of thousands of people.” That’s right. On your side of the border, not on ours. He said, “We will not do that. We will not do that.” I said, “Listen, I don’t want to embarrass you. So send me over your representative.” And a man came over to the White House two days later wearing the most beautiful suit I think I’ve ever seen. And I wanted to ask him, who is your tailor? But I didn’t think that would be an appropriate way to start the negotiation. Most gorgeous looking. The guy was a handsome guy. That suit was like perfect. But I think I thought I wouldn’t do that. And I said, “We want a couple of things, but we want you to number one, provide us thousands of soldiers free of charge because you’re letting people pour into our country.” They said, “We won’t do that.” I said, “Yes, you will. One hundred percent.” He said, “We won’t.” I said, “Yes, you will.” He said, “No way.” I said, “Way.” And I said, “You’re going to do it.” And the woman from the State Department, very good woman, but a terrible negotiator. She was 25 years old. She did was Mexico. And I said, “We want this and we want that. We want all these different things, 10 different things. The medical stay. We wanted everything.” And she said, “Sir, I’ve been after that for 25 years.” I said, “Well, maybe you and I are different. I won’t guarantee you I will have it by the end of this meeting.”\n\nSo I told him, “You’re going to give us all of these different things and you’re going to keep the people there. And we’re going to let the people in if we want to, because we want to have people come in. But we want them to come in legally. Right.” And he said, “Sir, we won’t do that. We will not do that. And we’re not going to do remain in Mexico.” I said, “Here’s the story. It’s Friday by Monday morning at seven o’clock. If you don’t approve this, and that means over the next five minutes, we are going to charge you tariffs of 25 percent, 50 percent, 75. They’re never going to stop.” He said, “Sir, you can’t do that. That’s not fair, sir.” I said, “No, it’s not fair that you’re sending people through your country and into our country and destroying our country. It’s not fair. That’s what’s not fair. So this goes into effect at seven o’clock on Monday morning. Have a nice weekend.”\n\nHe comes back. “May I see you in five minutes? May I make a call to Mexico?” I said, “Are you going to call the president?” “Yes, I am.” He comes back in two minutes. “Sir, it would be our honor to supply you with soldiers. It would be our great honor to supply you with as many soldiers free of charge, of course, sir, as many as you have.” No idea what I did in the White House. I stopped wars with France. France, you know, the France story, they were going to charge us. Look at this. Twenty-five percent to all of them. I have to protect American companies, whether we like them or not. Some of them I didn’t even like. You know, Google is treating us much better. Do you notice that? What happened to Google? They’re treating us much better. Very nice. I appreciate that very much. They say McDonald’s was one of the most viewed things that they’ve ever had. That was a hell of a one, right? But France, Emmanuel Macron, good man, nice guy, but he likes — he’s a wise guy, though. And he likes France. And I like the USA. So I heard about it. I gave it to our people. I said, “Tell them we’re not paying this massive 25 percent tax on our companies. We have to protect our companies.” And I gave it to Mnuchin. I gave it to everybody. I said, “You call them and tell them.” They came back, “Sir. They won’t do it.” Then they came back again, “And they won’t do it.” I said, “You got one more chance. Come back.” They came back, “Sir. They won’t do it.” And I called up Emmanuel. I said, “Get me Emmanuel Macron.” I said, “Emmanuel, here’s the story. You’re charging our companies, very unfairly, a 25 percent tax. Is that right?” “Oh, yes, Donald. This was approved by our parliament or whatever the hell they have over there. There’s 47 different names for that stuff. Yes, Donald, this was fully approved. And there’s nothing much I can do about it.”\n\n“Emmanuel, here’s the story. If you don’t take that tax off by the end of business hours today, I’m charging you a 100 percent tariff on every bottle of wine and champagne that comes into the USA.” And he said, “Donald, Donald, that is not fair.” I said, “No, it’s not fair that you’re charging our companies this massive tax because they happen to be American companies. I said, we’re not a stupid country anymore, Emmanuel.” He’s used to he’s used to dealing with stupid people over here because we have we’ve had some beauties, the deals that we allow. And he said, “It’s not fair.” I said, “You got three minutes, Emmanuel. Tell me what to do.” “May I call you back?” “Yes,” he calls me back. “Donald, we have decided to remove the tax from American companies.” I did that.\n\nI could stand up here. Nobody writes about this stuff. And I wish I put it on tape. But every time I think I say, “Oh, I’d love these conversations,” I could tell you with easily what I did. I could say, here’s the problem. Every time I think about putting I want to tape every conversation. The problem is, then I start thinking about Richard Nixon did that. And I say, you know, let’s do without the tape. We’ll do without this. Now, every time I want, I said, “Did we record that?” “No, sir, we did not.” I wish because some of them were classics. You could really hear something. But now we don’t want to do that. Richard Nixon, that was not good. When they found out, he taped every single conversation. But under Kamala, the construction industry will be decimated. You have to vote Trump and we will rebuild America. We’re going to rebuild America. We’re going to do it quickly, too. And we already gave you the biggest tax cut in history. We gave you the biggest regulation cuts by far, by five times in the history of our country.\n\nAnd, you know, I went to the big business guys. They come in and they kiss my ass. It’s unbelievable. These guys, you know, before I was president, “Trump is on the phone.” “Tell him I’ll call him back sometime.” Once I became president, “Oh, sir, it’s such a pleasure to speak to you, sir. It’s such a great honor.” I see him. It’s unbelievable. It’s unbelievable. But we got you the biggest tax cuts in history, biggest regulation. And I said to some of the biggest guys running the big companies — good guys, some good guys, some bad guys, some are really stupid as hell, some are good. But I said, “Let me ask you, you had — I gave you the biggest tax cut in history, along with everybody, and it created jobs, all that. And I gave you the biggest regulation cuts in history. Which is better?” Every single one of them said the regulation cuts were more important. People couldn’t do anything. They couldn’t build anything. They couldn’t build plants. They couldn’t build — I approved one in Louisiana. Fourteen years, it was under — they know exactly which one, big LNG monster — $14 billion to — $14 billion it was going to cost. I think Japan and other countries were putting up the money. After 14 years, they gave up. And I called my people together, and I said, “We can’t lose that. It’s so good. Number one. Number two, the jobs. Number three. I mean, it’s just important that we — it’s vital that we have it.” I got it done in one day, it was done. Congratulations. They use, a lot of times, the environment to try and stop projects. Not a lot of times. Let’s say every time. But we have to be very careful with that, because we’re all environmentalists, but we have to be very careful. You destroy our country. I will pass historic tax cuts for our workers and small businesses. And we will have, very important, no tax on tips, no tax on overtime, and no tax on Social Security benefits for our seniors. And we’re also going to do something else. And this just came, and I announced it in Detroit, because Detroit has been decimated. It’s been decimated by stupid politicians. And we — it just came to me. I was called by some of the smartest guys on Wall Street. They said, “How did you ever think of — ” I used the paper clip, you know? The paper clip, very simple. They take a little piece of wire, they go like this. The guy became rich. And once everybody saw it, it comes in a little box, 129 years ago, probably the same little box. And everybody said, “Why the hell didn’t I think of that?” Well, this is the same thing. Tax deduction on interest payments on a car. How about that? How about that? Nobody ever thought of that. And then they came up with a little wrinkle. But only if the car is built in the USA. Is that a good idea? Right? And then I’m going to be working with Elon Musk, who endorsed us very powerfully. He’s great. All I know is I watched that rocket come down. I never saw it. I thought I was watching a movie or something, a space-age movie. I watched that rocket. I was on the phone with a very important person that everybody in this room will know. So I got to be careful using his name. I like to be nice and careful. You know that. And then I decide, am I better off being careful or really entertaining people? And I usually decide on the side of entertainment. And then I have fun.\n\nYou know, I’m talking to this very powerful big guy. We’re talking, bop, bop, bop, bop. And I have the screen on the television and it’s muted, can’t hear the sound. And I’m gone. I’m seeing this rocket 20 stories tall, something like that, massive. And it used to be white, beautiful, polished white, and now it’s all brown from that, like a million-degree temperature coming down, pouring down at 20,000 miles an hour. And it’s pouring. And I see that thing is steaming and crazy, and the fire’s all over the place. And I’m looking. And then I see the gantry, the big gantry, and I see the thing coming in and slowing down a little bit, but it’s still going fast. And I tell this very important guy, “Listen, would you do me a favor? Hold it for a minute. This is obscene. Just hold it. Hold it.” When you’re leading in the polls and when you already were president, you can say that to important people. Just hold it. So I take the phone and put it down. The sad part is I never picked it up. I figured they’ll say he’s cognitively imbalanced. He didn’t pick up. These people, are they the worst?\n\nSo I take the phone. I put it down. I say, “Just just a second. I’m watching something that I don’t believe.” And I see that fire pouring on the bottom of the rocket that’s coming in sideways. I said, “It’s going to crash into the gantry.” And then the fire goes on the left side and pushes it over and it lands. And then those two big, beautiful arms, they grab it. I said, “What the hell was that?” Nobody’s ever seen anything like that. So I forgot about my other call and I called immediately Elon. I said, “Elon, was that you?” He picks up his cell. I said, “Was that you, Elon?” “Yes.” I said, “Can anybody else do it?” “No.” “Can Russia do it? Can China do it? Can the USA do it outside of you?” “No. Nobody else can do it.” I said, “What do you call those arms?” He said, “Think of them as chopsticks. That’s the way they’re like chopsticks. They just grab it and they just put that thing down so beautifully.” I said, “That’s great.”\n\nSo he’s great. He gave me the most beautiful. You know where he is now? He’s working in Pennsylvania, trying to get us lots of votes because he thinks it’s so important. He’s campaigning. Because he said, “This is the most important election in our lifetime. And if Trump doesn’t win the election, our country is potentially ruined.” I mean, he’s as strong as anybody I’ve ever seen. So we have to say, this is a seriously smart guy, right? You know, he helped us so much with the hurricanes because North Carolina had no communication whatsoever. And I was there early, and I met one of the people that are in charge. And they said, “All our wires are down and people are dying, a tremendous amount of people missing and dying and the horrible thing. What a horrible hurricane that was.” It was a water hurricane, more water than we’ve ever experienced from one storm. And it created rivers out of valleys. I mean, rivers that were 25 feet high and running down like rapids. It destroyed just about everything. And they had no communication. And the gentleman said to me, “Is there anything you can do? Do you know a man named Elon Musk?” I said, “I happen to know him. What’s the problem?” “Could he get us Starlink? We’re trying to get it. Nobody can get through Starlink.” Nobody couldn’t get it because it’s very successful. So I called Elon. I said, “Elon, whatever the hell Starlink is, can you do me a favor? Can you get it to North Carolina? They need it so badly.”\n\nAnd then we talked just for a couple of minutes. And the guy wires me. “Thank you very much for getting Starlink.” I’m still on the phone with Elon. He said, “Sir, thank you very much for the Starlink. They said it’s coming right away.” I said, “Elon, we didn’t even hang up. How the hell did you do that?” He said, “That’s my secret.” He’s really a great guy. And he gives up a lot. He gives up a lot. No, he’s given up. I mean, it’s amazing that he does it. You know, people don’t have to. He just feels so strongly that we’re not going to have a country left with these people because she’s really seriously. This is not a smart person. And it’s not a person that understands. And you can’t even say, “Well, let’s go to the vice president,” because he is really a sicko. Right. Remember, he called J.D. Vance and I weird. We’re not weird. We’re very solid people. He’s a weird dude. That guy, he’s always pumping his heart, ha ha ha, you know, like he’s got great heart. He’s a sick guy. You got both of them. I don’t know who the hell is worse. Well, she did one thing that’s very smart in the world of politics. She got herself the worst person possible to be vice president. You understand that worse so bad that they’d probably leave her. I don’t know. And by the way, how good is J.D. Vance? How good is that? We drafted the athlete. We drafted the athlete. You look at his academic credentials and all of the different things we drafted. A great athlete. He’s doing great. He’s a great guy, too. So working with Elon Musk, I will cut a record number of job killing unnecessary regulations which will blow your mind when you see how many. And on day one of the Trump administration, I will terminate Kamala’s insane electric vehicle mandate, and we will end the Green News scam once and for all, once and for all. And we will quickly again. We were never energy independent until I came along. We were energy independent. We went from number four to number one in a couple of years. We have more liquid gold under our feet than Russia or Saudi Arabia. I got Anwar approved. It’s as big potentially as Saudi Arabia. In the first week in office, crooked Joe Biden probably made a deal. Crooked Joe Biden terminated the approval. Ronald Reagan wanted it. He couldn’t get it done. Everybody wanted it. I got it done. I got it done. But they were all set to start drilling one of the biggest mines anywhere in the world, as big they think, as Saudi Arabia. And in the first week, they terminated.\n\nWe will have that unterminated so fast. Alaska. But we will quickly become energy dependent again. We weren’t energy independent before that, to anybody’s recollection. We weren’t energy independent before that for maybe a hundred years. They don’t know at any time, but we were and we will quickly become energy independent and we will frack, frack, frack and drill, baby, drill. We’re going to drill, baby, drill and frack, frack, frack. Now, she’s not going to frack her whole life. She’s talking about there will be no fracking. There will be no fracking. And I will cut your energy prices in half within 12 months, 50 percent, half, five-oh. Starting in January, we will give our companies the lowest taxes, the lowest energy costs, the lowest regulatory burdens and free access to the single best and biggest market on the planet. But it won’t be that way for long. If we have stupid people like this running our country, you’re not going to have the big market anymore. It can go very fast. Look at Venezuela. Fifteen years ago, it was an unbelievable country. Now it’s a disaster. They can’t get water. They can’t get food. But what did Biden do? He starts buying oil from them. Do you believe it? And we have so much. So he’s putting them back to health. Such a great move to do. They were ready to give up. We could have let the people go back into Venezuela. This guy, I tell you, the worst, Jimmy Carter is the happiest man because his administration is brilliant compared to these two losers. Jimmy Carter is a happy man. You saw him the other day voting. I think he voted for me.\n\nBut only if they make their products here. This is it. Got to make their products. Everything is based on you got to make your products in America. No more making them in China, making them all over the place. And you got to hire American workers for the job. And if these companies don’t make their products here, then they will pay a very stiff tariff when they send their products into the United States where they’re made by somebody else or some other country. We have the privilege of competing with our workers and our cherished, but now very protected companies. We’re going to protect these companies. We’re going to have a lot of companies moving. You watch Detroit, Detroit, you know, for 40 years ago, I’ve been hearing about Detroit’s coming back, never came back. It’ll come back so fast with a series of brilliant incentives that won’t cost us anything. But most importantly, tariffs and taxes. Everybody’s going to be moving back into the country because they’re not going to want to pay. And one quick story. Just a quick. Should I say it or should I just get the hell out of here? One quick story. I thought you were going to say that. One quick story.\n\nSo about a year and a half ago, the largest builder of auto plants, who I know, John, I said, “I want to see one of your factories that you’re building is the biggest.” And he said, “OK.” I said, “Where would we go?” “Mexico.” I said, “I don’t want to go to Mexico. What the hell do I want to go? I want to see one here.” “Well, we don’t build them big here.” He builds them all over the world. He doesn’t care. He builds them wherever the hell they pay him. And that’s, by the way, with companies. That’s why they move out of our country in two minutes if they’re not going to be given the right deal. So I said, “I don’t want to go to Mexico.” He said, “Well, the big ones are built in Mexico. I’m sorry.” I said, “How big is it?” “The biggest in the world. They’re going to build cars.” Think of this. Thousands, millions of cars are going to sell them into the United States, destroy Michigan. If Michigan doesn’t vote for me, I tell you, I am. I’m going to make Michigan richer than anybody. I think even richer than you. I hate to say it. Michigan. OK, they’re going to we’re going to bring back the whole car business, but you can get plants also. OK, because I don’t care as long as they’re in the United States. I can’t. I couldn’t care less. So so I said, “How big would that be?” He said, “They’ll make more cars than all of the state, the entire state, much more than Detroit. These are big monsters. You press a button and it’s unbelievable. And the biggest in the world.”\n\nI said, “Well, I don’t like that. That’s going to kill him.” So I started talking about it and this plant that’s being built and everyone said, “Oh, it’s not real. What is?” And then it was going to start. And then last week, I spoke in front of the Economic Club of Detroit and I spoke about cars and I talked about this plant. And in the audience, just like right where you’re sitting, sir. Good looking guy. Stand up, please. Right. You. That’s right. Yeah. Stand up right in your seat. That’s where he’s that. Right there. I looked in the audience. And who do I see? I see John. And I said, “Oh, I pass a message to him while I’m speaking,” because this was more interesting to me than anything I was doing up there. And I said, “I want to see you after this.” I see him afterwards.\n\nI said, “John, tell me something. How is that monster plant? And it’s actually more than one. But this one monster, how’s it doing?” “Sure. They’ve abandoned that plant.” “What?” “That’s great news, you know, because it’s going to kill us.” “What do you mean they’ve been?” “They think you’re going to be elected president. You’re going to put tariffs on their cars and they won’t be able to make any money. They’re going to lose their shares. They’ve abandoned the plant.” I said, “That’s the greatest thing I’ve ever heard.” Marjorie, that’s the greatest thing I’ve ever heard. So Michigan can now keep their car companies going. But in all fairness, those are old plants and stuff. Generally, we’re going to give them the greatest new plants. We’re going to give them plants that are going to be unbelievable. We’re going to put the autoworkers, you know, the autoworkers want Trump. The Teamsters want Trump. Did you see the Teamsters? The rank and file of the Teamsters voted 62 percent for Trump. Never have no thing like that ever happened before. The firemen nationwide voted for Trump. The firemen never happened before. Never happened before. But I will never apologize for defending America. I’m not going to do it. I will protect our workers. I will protect our jobs. I will protect our borders. I will protect our families. And I will protect the birthright of our children to live in the richest and most powerful nation on the face of the earth. And that’s what we’re going to have. Under Kamala. You know, this crazy Kamala thing is just crazy. First of all, you can’t call a Harris because nobody knows who the hell you’re talking about. If I say to the legendary Marjorie Taylor Greene, “Harris,” I say, “What do you think of the job Harris is doing?” She’ll say, “Who the hell is Harris?” Nobody knows. No, it’s the truth. Nobody knows who the hell Harris is. It’s the weirdest thing, isn’t it? So you have to say Kamala under Kamala and her economy, millions of Americans. She has no idea about an economy. She’s not a smart person. She’s a low IQ individual. She is. She is. She’s a low IQ person. Millions of Americans are suffering because of inflation. They’re losing their jobs. They can’t afford housing, groceries or a car. And yet Kamala is importing millions of illegals across our borders and giving them taxpayer benefits at your expense. And putting them into luxury hotels in New York and Chicago and Los Angeles while our veterans are sleeping outside of that hotel on the street. So you are witnessing the economic oppression of Americans to reward and enrich illegal aliens. But all of that stops two weeks from now. For four straight years, Kamala Harris has imported an army of illegal alien gang members and migrant criminals from prisons and jails and sane asylums and mental institutions from all around the world, from Venezuela to the Congo. You know, the Congo is a hot country now for us. They’re sending us their prisoners by the thousands. All over the world, they’re coming in from the Middle East. They’re coming in. Their prisons are being opened. Venezuela, their prisons. I would do the same thing. I would do it. I would have done it faster than any of them. Venezuela still has some prisoners left. I mean, it’s amazing that they’ve been so nice to us. They’re depositing their prisoners. They’re dumping. We’re dumping ground. They’re dumping their prisoners, their gang members, their drug lords into the United States of America because they say that America is run by stupid people and they have open borders.\n\nThey have an open border where anybody can come in, just walk across. Historically, when you have swastikas on your forehead and swastikas all over your cheek and lots of other symbols all over your face, historically, that person isn’t going to be a tremendous help to our economy. And yet they walk, they walk through, they walk through that open border and probably say, “Man, are these people stupid?” And then they start to kill. They kill. And we built, we built over 500 miles of wall and we were going to add 200 miles of wall. And it was already made as per specifications of the Great Border Patrol. They want steel, they want concrete, and they want rebar. I wanted just plank. I wanted concrete, beautiful, like long spans of a car. I’m very good at construction, actually. I wanted long spans of concrete plank. They didn’t want, they said, you have to have steel because they cut through concrete too easily. We had a whole big deal. But we gave them just what they want. Even the anti-climb panel on the top, do you know the big panel of steel? I hate it. I hate the look of it. But guess what? It’s called an anti-climb panel for a reason. Put it up there. We have great stuff, very expensive to build. Hardened concrete and hardened steel, very hard to cut, even with a blowtorch. I had a very hard time taking it down. And then I ordered 200 miles more, and we could have had it put up in three weeks to four weeks. And they didn’t want to put it up. And then they started selling it for 5 cents on the dollar for steel, okay?\n\nAnd then she resettled these people into your communities all over America, and they’re the roughest people. When I win on November 5th, the migrant invasion of our country ends and the restoration of our country begins. One of the deadliest and most vicious migrant gangs that Kamala has imported into our country through her open-border policy. Remember, she was the border czar. She doesn’t like saying that, but she was the border czar. And even if she wasn’t, she was in charge of the border. Do you know, I asked the Border Patrol, “Did she ever call?” Not once. I spoke to the top 10 guys. “Did any of you — ” I know them very well. They’re phenomenal people, by the way. They want to have a great, strong border. They hate — you know, it’s easier for them. Let them pour in. Who the hell needs to get hurt? Because it’s a rough deal. These are rough people. And I said, “Did she ever call?” Not once. Not one of them ever received a call. She admits it. She never called them. But the savage Venezuelan prison gang, Tren de Aragua — have you heard of them? They’re a lovely group of people — Tren de Aragua — that is taking over apartment complexes and unleashing a violent terror spree all over America, but specifically in Aurora, Colorado, where the governor is petrified of them. He’s a radical-left Democrat. He is petrified of them. He doesn’t know what to do. They’ve even taken over Times Square. There’s a front-page article today in the New York Post. They’re taking over Times Square in New York, and they have weapons that our military doesn’t even have. You say, “Where the hell are they getting the weapons?” But we have guys that want to confront them, and they’re going to be allowed to confront them. And we’re going to get them the hell out of here. And that’s nice. That’s some of the nice stuff. It’s much worse than that. The United States is now an occupied country. But on November 5th, 2024, we will call that Liberation Day. It’s going to be liberation. Under Kamala Harris, over 13,000 illegal alien convicted murders from prisons, all in prisons. Some killed more than five people, many killed more than one, were allowed to enter the United States, and they’re currently on the loose in the United States.\n\nRight here in Georgia, our nation was robbed of a brilliant 22-year-old nursing student, the best student, the best everything, most respected person, beautiful person. Lincoln Riley got to know her family very well. They didn’t get to know, they never called her family, they never called. And then he pronounced her name wrong, remember, he called her Lincoln, remember that? In Congress, he called her Lincoln, didn’t even have the respect of knowing her name. Who was out for a jog when she was assaulted, horribly beaten, and horrifically killed by an illegal alien from Venezuela. The savage monster who murdered Lincoln was let in and released into our country by the open border policy of Kamala Harris. The brother was also in Georgia of this killer. He was there illegally and is also a member of Tren de Aragua. This gang is violent, but so is MS-13 coming out from all over South America. These are violent. They don’t shoot people, they use knives because it’s more painful. They killed two young, beautiful 16-year-old girls walking to school in Long Island, and they cut them up into little pieces and they thought it was so wonderful. And you know who got them is ICE, who went in and got them. And Kamala wants to get rid of ICE. Not a lot of people want to do that particular job, but ICE loves doing that job. Earlier this year, an illegal alien that Kamala Harris released into our country brutally stabbed a man in the back and the face, all over his body in an attempted robbery in Louisiana. The week before, he raped a 14-year-old girl with a knife to her throat, which killed other people. And immediately upon taking the oath of office, I will launch the largest deportation program in American history. I will rescue every town across America, and every town is worried about it. Every town is. Look at Springfield, Ohio. Beautiful Ohio. I love Ohio. I love Ohio. Look at Springfield, Ohio, a town, small city, but a town of 50,000 people. They’ve implanted 32,000 illegal migrants into the town. Nobody could survive that. They have to leave. They have to leave. I’m sorry. Nobody could survive that. A 50,000-person town, quickly, 32,000 illegal migrants. They call them legal because they had a little trick, but it’s illegal.\n\nI will rescue every town, and every town is petrified, even if they don’t have them, because they know they’re coming. They’re heading for the towns. They’re heading for the towns. Who could do this to our country? Who could do this? Who could do this to our country? It’s only good if you are a politician thinking about running for office and running against them. That’s about the only thing that’s good for. Who could do this to our country? Who could allow this to happen to our country? I will rescue every town across America that has been invaded and conquered, and we will put these vicious, bloodthirsty criminals in jail or kick them the hell out of the country. And we’ll do it very fast. And to expedite removals of the Trinidad, Aragua, and MS-13 gangs from our country, and many others, by the way, I will invoke the Alien Enemies Act of 1798 to target and dismantle every migrant criminal network operating on American soil.\n\nThink of that. We had to go back to 1798. That’s when we had laws that were effective. 1798, we had to go back to. And if they come back into our country, it’s an automatic 10 years in jail with no possibility of parole. Automatic, if they come back into our country. And I’m hereby calling for the death penalty for any migrant that kills an American citizen or a law enforcement officer. And And I will end catch and release. They’ll be released into Mexico. We will have catch and release, but not into America. It’ll be catch and release into Mexico. I will end all migrant flights. They fly thousands and thousands of people over the border. They’ve told you with this bill that they keep saying Trump called the senators and said don’t sign it. They’re wrong about that. What they don’t say is that they put a little bit — they made it a little bit harder because they’re getting killed for this election. So they made it a little bit harder. They want to make their numbers look a little bit better. For what they didn’t stop are Boeing 747s and 757s and 767s flying over our border, loaded up with migrants and dropping them off in the Middle West and the middle part of our country.\n\nThey forgot to tell us that, but we saw them. We said, “What are all those big planes doing flying there?” These people are bad people, so they didn’t want to stop anything. I will immediately outlaw sanctuary cities in this country. They’re sanctuary for criminals. And I will ban all welfare and federal benefits for illegals, because then they won’t come. They won’t come. I mean, Gavin Newsom, one of the worst governors in the history of our country, Gavin Newsom, she destroyed San Francisco. Now she wants to destroy our country. That’s Kamala. But she worked with Gavin Newsom. What they’ve done to California. You know, now we have more people leaving California, the most beautiful place. And I tell people I hurt myself when I say that because I have great property there. When I say that, this political game has not been good for me. But I don’t care. It doesn’t matter. It’s peanuts.\n\nThis is the whole thing. We’re going to save our country. What the hell difference does it make? No, it’s a killer. I have property in San Francisco, big property. And I say that she’s destroyed San Francisco. She started the destruction. It was the best city in America 18 years ago in California. What they’ve done, what they’ve done to California, her governors come to the same group. It’s just like terrible. They’ve destroyed it. And we’re not going to let them destroy the United States of America. We’ve gone far enough as we secure our borders and rebuild our economy. We are also going to make America healthy again. The Kamala health care plan will make our kids sicker and their diets more toxic. Under the Trump administration, we will get the toxic chemicals out of our food supply and we will make our children healthy again. We will spend more money on health care than any other nation. But think of that. You know, we do. I don’t know if you know, we spend more money by far, by far than any other nation. But we have more chronic health problems also than any nation. More childhood diseases than we did just a generation ago. Millions of Americans are realizing that something is wrong by getting this fixed. We’ve gone far enough as we secure our borders and rebuild our economy. We are also going to make America healthy again. The Kamala health care plan will make our kids sicker and their diets more toxic. Under the Trump administration, we will get the toxic chemicals out of our food supply and we will make our children healthy again. We will spend more money on health care than any other nation. But think of that. You know, we do. I don’t know if you know, we spend more money by far, by far than any other nation. But we have more chronic health problems also than any nation. More childhood diseases than we did just a generation ago. Millions of Americans are realizing that something is wrong by getting this fixed. Not only will we have healthier families, we will save trillions and trillions of dollars and bring down the cost of health care. With us tonight is the man who’s going to help us get it all straightened out. Robert F. Kennedy, Jr. We have a thousand chemicals in our food that are illegal in Europe. But the problem is not from those chemicals. The big problem is corruption in our federal agencies. And these agencies are now owned by big pharma, by big food, and big agriculture."}
  ]
}