{
    "authors": [
        "Donald Trump 2024-12"
    ],
    "date": "2024-12-06",
    "context": "Meet the press interview with Kristen Welker",
    "content": [
        {
            "author": "Donald Trump 2024-12",
            "content": "Well, we're going to do something with the border and very strong, very powerful. That'll be our first signal and the first signal to America that we're not playing games. We have people coming in by the millions, as you know, and a lot of people shouldn't be here, most of them shouldn't be here, but we have jails being emptied into our country. We have mental institutions from all over the world being emptied into our country. So we'll be doing that. We're going to be extending within that period or as soon as we can, the Trump tax cuts because you know they're coming due and they're very substantial for people. And I think it will anger a lot of people, frankly, if we don't get an extension of that. That's what led us to one of the greatest economies ever. And those two things are going to be very vital, very important. We're going to be focusing on crime in the cities and we'll work with Democrat governors. Most of them are, as you know, if you look at the 25 worst places, they're just about all Democrat controlled cities and states. And we're going to be working with Democrat governors and Democrat mayors and I look forward to doing it. But we have to do something about crime and mostly in our cities, and we're going to have a lot of other things. We'll be working on nominations. We're going to still be working on some nominations. I think they're going very well. We have, for the most part, I think they're going extremely well. It looks like Pete is doing well now. I mean, people were a little bit concerned. He's a young guy with a tremendous track record. Actually went to Princeton and went to Harvard. He was a good student at both, but he loves the military and I think people are starting to see it. So we'll be working on his nomination along with a lot of others. Yes, I do. I really do. He's a very smart guy. I've known him through Fox, but I've known him for a long time and he's basically a military guy. I mean, every time I talk to him, all he wants to talk about is the military. He's a military guy. I used to kid him about it. I didn't think we'd be in this position where he may be, hopefully we'll be Secretary of Defense, but every time I was with him, he was fighting for soldiers where he said some soldier was unjustly put in prison because they were really doing what they were taught to do in some cases. So yeah, I think he's going to do fine. No, I think that everybody has something that they can stop. Some people can stop eating. I'm lucky I'm not a drinker, but I could stop eating and we all want to stop doing something. And if he said that, I mean, it's a nice thing to say. That's a good thing to say. But he's very respected. I can tell you I know a lot of the people at Fox, they think he's fantastic. And the people that work with him, really, they love him. So I think you're going to have somebody that's really terrific. And again, all he talked about with me, I said, 'You're not really a television guy,' even though he did very well, as you know, 'You're really a military guy.' He said, 'I'm all about the military.' So he's making a lot of money at Fox, he's doing very well. And I said, 'If for some reason you don't get this thing, you're not going to be able to go back and all that money you're making, you can kiss it goodbye.' He said, 'This is all about America.' And he didn't say, 'Well, let me think about it. Let me discuss it.' That's a very big risky thing he's doing. When he goes and he says, I'm going to give up millions of dollars in order to possibly become the Secretary of Defense, a lot of people would say it's a great position. There's probably almost no greater position. But a lot of people would say, have to think about it. He said, 'I don't have to think about it.' I can't guarantee anything. I can't guarantee tomorrow. But I can say that if you look at my just pre-covid, we had the greatest economy in the history of our country, and I had a lot of tariffs on a lot of different countries, but in particular China. We took in hundreds of billions of dollars and we had no inflation. In fact, when I handed it over, they didn't have inflation for a year and a half. Almost two years, just based on what I had created. And then they created inflation with energy and with spending too much. I'm a big believer in tariffs. I think tariffs are the most beautiful word. I think they're beautiful. It's going to make us rich. We are subsidizing Canada to the tune of over $100 billion a year. We're subsidizing Mexico for almost $300 billion. We shouldn't be subsidized. Why are we subsidizing these countries. If we're going to subsidize them, let them become a state. We're subsidizing Mexico and we're subsidizing Canada and we're subsidizing many countries all over the world. And all I want to do is I want to have a level fast, but fair playing field. They cost Americans nothing. They made a great economy for us. They also solve another problem, if we were going to have problems having to do with wars and having to do with other things, I have stopped wars with tariffs by saying, 'You guys want to fight, it's great, but both of you are going to pay tariffs to the United States at 100%.' And they have many purposes, tariffs, if properly used. I don't say you use them like a madman. I say properly used, but it didn't cost this country anything. It made this country money and we never really got the chance to go all out because we had to fight Covid in the last part. And we did it very successfully. And when I handed it over to Biden, the stock market was higher than what it was just previous to Covid coming in, was actually higher. Tariffs are a, if properly used, are a very powerful tool, not only economically, but also for getting other things outside of economics. Let me just explain to you. No, you mentioned washing machines. So you look at Whirlpool in Ohio, I got a call from Jim Jordan, one of the greats, congressman from Ohio, and he said they're going out of business because South Korea and China are dumping washing machines into our country. And I put a 50% tariff on the washing machines coming in from China and South Korea, and Whirlpool and the companies that made washing machines, which are based in Ohio, largely based in Ohio, went through the roof. We saved thousands of jobs, tens of thousands of jobs. They were all going out of business because they were dumping washing machines. And when I put the tariffs on, they became successful businesses. Not only didn't it cost people, it made our country stronger and more powerful and it kept jobs. Well, the market's going to take care of it. I mean, actually the market takes care of it. And if it doesn't, we adjust it somewhat. But in the case of Whirlpool or let's say companies that made washing machine, they were all being put out of business by the dumping from in particular South Korea and China. And when I put the tariffs on first, substantial tariffs, although peanuts compared to what people do to us, what countries do to us, it became a very, very powerful, successful company. Now, let's say I didn't do the tariffs. It would've gone out of business. You would've lost tens of thousands of jobs, and you don't include that in your equation. No, they make a lot of money. I'll go a step further. Tariffs are going to make our country rich. Tariffs are going to help us pay off $35 trillion in debt. Tariffs are going to make our country safe because China, as an example, doesn't want to play games with us if we're going to do tariffs on them. They don't want to play games. And we have a lot of games being played on us right now. Well, I'll give you an example. With Canada and in particular Mexico, we have millions of people pouring into our country. You agree with that? I spoke with both. I spoke with Justin Trudeau. In fact, he flew to Mar-a-Lago within about 15 seconds after the call-in, it was at Mar-a-Lago, we were having dinner talking about it. I said, you have to close up your borders because they're coming in the northern border too, a lot. Not like the southern border, but they're coming in the Canadian border a lot. And drugs are pouring in. Almost as importantly, drugs are pouring in. Maybe more importantly, drugs are pouring in at levels never seen before. 10 times what we had. They're just pouring in. We can't have open borders. And I said to the President of Mexico and to Justin Trudeau, 'If it doesn't stop, I'm going to put tariffs on your country at about 25%.' That's a very substantial tariff. And in both cases, but in the case where it was really visible, within 10 minutes after that phone call, we noticed that the people coming across the border, the southern border, having to do with Mexico, they were a trickle. Just a trickle. In fact, I call the border. See, unlike my opponent, I do call the border a lot. And I said, 'How's the border looking today?' They said, 'There's nobody here.' They couldn't believe it. The military stopped these vast groups of people, we call them caravans, but they had caravans of people and they largely stopped them. Now, they're going to have to continue that, but if they don't continue, and the other thing I told them is no more drugs. And I told that to China too. I had to deal with President Xi. Had the election been different, I'm going to be very nice because we don't have to get into an argument over 2020, but had the election been different, the result been different, we would've had China giving their maximum penalty, which is the penalty of death to people that sent Fentanyl into this country. But Biden didn't unfortunately finish that discussion up. I had an agreement with President Xi who I got along with very well, we've had communication as recently as this week, and I had communication with him where they were going to give the death penalty to anybody sending drugs into the United States. It's a very low number. I will agree. It's a very low number. Let me give you the downside though. In California, they raised it up to a very high number, and your restaurants are going out of business all over the place. The population is shrinking. It's had a very negative impact, but there is a level at which you could do it. Absolutely. I don't know. I mean, I really don't know. I can say this. You have a lot of businesses that are open and thriving because of the lower minimum wage. If you raise it too much and you understand this, if California went crazy, they went crazy, the restaurants are closing, all of them. Many more people are hurt. I would consider it. I'd want to speak to the governor's. And the other thing that's very complicated about minimum wages is places are so different. Mississippi and Alabama and great places, are very different than New York or California. I mean, in terms of the cost of living and other things. So it would be nice to have just a minimum wage for the whole country, but it wouldn't work because you have places where it's very inexpensive to live, where a minimum wage, which is eight or $9 might have very little effect because the cost of living in certain places is really low. Well, I think you have to do it, and it's a very tough thing to do, but you have have rules, regulations, laws, they came in illegally. The people that have been treated very unfairly are the people that have been in line for 10 years to come into the country. And we're going to make it very easy for people to come in terms of they have to pass the test. They have to be able to tell you what the Statue of Liberty is. They have to tell you a little bit about our country. They have to love our country. They can't come out of prisons. We don't want people that are in for murder. So we had 11,000 and 13,000 different estimates, 13,099 murderers released into our country over the last three years. They're walking down the streets, they're walking next to you and your family, and they're very dangerous people. No, it's within the three-year period. It's during the Biden term. Now, that was a fiction that they put that out. This was done by the border patrol. It's 13,099, and it's during the Biden period of time. And these are murderers, many of whom murdered more than one person. You don't want those people in this country. I'm saying this. We have to get the criminals out of our country. We have to get people that were taken out of mental institutions and put them back into their mental institution, no matter what country it is. Do you know that Venezuela, their prisons are at the lowest point in terms of emptiness that they've ever been? They're taking their people out of those prisons by the thousands. And just to get back because I know exactly what you're getting at. Number one, we're doing criminals and we're going to do them really rapidly. We're getting the worst gang, probably with MS-13 and the Venezuelan gangs are the worst in the world. They're vicious, violent people. And you see what they've done in Colorado and other places. They're literally taking over apartment complexes and doing it with impunity. They don't care. They're in the real estate position. You have no choice. First of all, they're costing us a fortune, but we're starting with the criminals and we got to do it. And then we're starting with others and we're going to see how it goes. Others are other people outside of criminals. We have convicted murders. We don't mean people that are even on trial. We have people that have murdered numerous people are on our streets and in our farms, and we have to get them out of our country. The dreamers are going to come later and we have to do something about the dreamers because these are people that have been brought here at a very young age, and many of these are middle-aged people now. They don't even speak the language of their country. And yes, we're going to do something about the dreamers. I will work with the Democrats on a plan and if we can come up with a plan, but the Democrats have made it very, very difficult to do anything. Republicans are very open to the dreamers. The Dreamers, we're talking many years ago they were brought into this country, many years ago. Some of them are no longer young people, and in many cases they become successful. They have great jobs. In some cases they have small businesses. Some cases they might have large businesses, and we're going to have to do something with them.  I want to be able to work something out, and it should have been able to be worked out over the last three or four years, and it never got worked out. Biden could have done it because he controlled Congress to a certain extent. He could have done something, but they didn't do it. I never understood why, because they always seem to want to do it, but then when it comes down to it, they don't. I think we can work with the Democrats and work something out. Well, that way you keep the… Well, I don't want to be breaking up families. So the only way you don't break up the family is you keep them together and you have to send them all back. Well, what are you going to do if they want to stay with their father? Look, we have to have rules and regulations. You can always find something out like this doesn't work, that doesn't work. I'll tell you what's going to be horrible when we take a wonderful young woman who's with a criminal and they show the woman and she could stay by the law, but they show the woman being taken out or they want her out and your cameras are focused on her as she's crying, as she's being taken out of our country and then the public turns against us. But we have to do our job and you have to have a series of standards and a series of laws and in the end… Look, our country is a mess. We have the highest crime rate, and during the debate, a man whose ratings have gone way down, David Muir said to me, 'No, crime is…' Because I had to debate three people, not one. Debating one was easy. Debating three was actually pretty easy too if you want know the truth, but David Muir said, 'The crime rates have gone down.' I said, 'No, they've gone up.' And then the following day they released the crime rates and they were way up. We don't have to separate families. We'll send the whole family very humanely back to the country where they came. That way the family's not separated. Well, it depends on the family. The family may decide to say, 'I'd rather have dad go and we'll stay here,' and in which case they have that option. We need deterrence. Look, ready? When somebody comes here illegally, they're going out. It's very simple. When they come here illegally, they're going out. Now, if they come here illegally, but their family is here legally, then the family has a choice. The person that came in illegally can go out or they can all go out together- Yeah, I'm doing what I just told you I'm going to do. I don't want to send the family out. I don't want to send anybody out, but I'll tell you, we have to, because otherwise we have no country. If we don't have borders and if we don't have voting, good voting, fair voting… Do you know they're still counting votes in San Diego, California? Listen, they're still counting the votes. This is almost four weeks. They're still counting the votes. If we don't have fair elections and honest voting and machines that work quickly. If you had paper ballots, every election will be over by 10 o'clock in the evening. You know we're the only country that has it. Do you know, if somebody sets just a foot, one foot, you don't need two, on our land, 'Congratulations, you are now a citizen of the United States of America.' Yes. We're going to end that because it's ridiculous. Well, if we can through executive action, I was going to do it through executive action, but then we had to fix COVID first, to be honest with you. We have to end it. It's ridiculous. Do you know we're the only country in the world that has it? Do you know that? There's not one other country- Well that's other thing. Do you know, we have thousands of judges, somebody walks onto our land and we have to now say, 'Welcome to the United States.' They could be a criminal or not a criminal. We release them into our country. It's called catch and release. We release them into our country. Wait, just one second. And now they get them lawyers and the lawyers are good lawyers and everybody has a lawyer and do you know how many judges we have? Thousands. Thousands. Now, here's what other countries do. They come into the land and they say, 'I'm sorry, you have to go.' And they take them out. Okay. With us, once they touch our land, we're into litigation that lasts for years, costs us hundreds of billions of dollars. We have judges and I'm sure they're all honest, but I don't know that for a fact. You can imagine what's going on with the judges, 'cause I have a lot of judges. I tell you what, I know more about judges than any human being in history. Look, we have judges. Every time somebody puts two feet or even one foot on a piece of our land, it's welcome to long-term litigation. Other countries, every other country, when somebody walks on and they see that they're here illegally, they walk them off, they take them back to where they came from. We have to get rid of this system. It's killing our country. So when John McCain let us down by voting and Murkowski and Collins and whoever it was that voted against, but they really let us down. They did us a great disservice 'cause we would've had great health… Obamacare is lousy healthcare. It's very expensive healthcare for the people. It's also expensive for the country, but for the people. It's lousy healthcare. When John McCain gave his thumbs down after saying for 10 years that he wants to repeal and replace, okay. And then he came out, he put his now famous thumbs down and he became a hero to the left. Let me just tell you, if we find something better, I would love to do it, but unless we find… But one thing I have to say, I inherited Obamacare or anything else you want to call it, it's got about 20 names. But I inherited it and I had a decision to make with health and human services. I had a big decision to make. Do I make it as good as we can make it or do I let it rot? And a lot of political people said, 'Let it rot and let it be a failure.' I said, 'That's not the right thing to do.' And I had very good people in the medical area that handled that. And I said, 'What do you want to do?' He said, 'We really have an obligation to make it as good as we can.' And we did. We made it as good as we can make it. Instead of making it bad where everybody would be calling for its repeal. I made it so that it works now. No, we got a little bit of a surprising opinion to be honest with you. If it would've been overturned, we would've had much better healthcare right now. But right now we have something that I made the best of. I could have made the worst of it and it would've fallen by the wayside. I did the right thing from a human standpoint, but I'm sort of proud of my decision, at the same time, sometimes I regret it. I told the people and I gave them the money to do it. I said, 'Fix it. Make it work,' because people would've suffered. But it's too bad that they voted. No, I wish John McCain, I wish he fought for 10 years on repairing, replacing Obamacare for 10 years and then he voted against. Nobody understands it. Let me explain. We have the biggest healthcare companies looking at it. We have doctors. We're always looking because Obamacare stinks. It's lousy. There are better answers. If we come up with a better answer, I would present that answer to Democrats and to everybody else and I do something about it. But until we have that or until they can approve it, but we're not going to go through the big deal. I am the one that saved Obamacare, I will say, and I did the right thing. I could have done the more political thing and killed it and all I had to do was starve it to death. I want the prices to go down. I want to have better healthcare for less money and there are ways of doing it, I believe, and I have the smartest people in that world. That's a separate world unto itself. I have the smartest people in that world looking at it and trying, and if they come up with something, I will present it. Now, maybe you won't be able to sell it, but if we get better healthcare for less money, I believe it's very saleable. Well, I don't know that you'll see it at all. I can only say that we have some of the best healthcare people. I've always tinkered with it. I think it's a little hard to explain. Obamacare, when I took it over was a disaster and I made it workable. … because if I repealed it and replaced it, we would've had a better system because we wouldn't have had healthcare and the Democrats would've been forced to do something. If we wouldn't have had it, the Democrats would've been forced to do something that they wouldn't do if we have it. Well, we're going to see, we want ideally the insurance companies to pay for it, the fertilization. I came out very early for Republican especially, and I think they were looking for my guidance, my great wisdom, right. They were looking for it and I got a call from Katie Britt, who's a terrific person, senator from Alabama, and she said, 'Sir, we just had a really negative ruling from a judge in Alabama, conservative judge that all of these clinics had to be closed.' And she went into great detail and she said, 'People are devastated over it.' And after literally speaking to her for five minutes, I issued an order, really an order in a sense, and it was a statement from the Republican Party that, 'We are all for IVF and fertilization.' Okay. The Alabama legislature met the following day and passed it. It was a beautiful thing to see and I consider myself to be the father of IVF in a certain way and the Republicans were very strong on the issue. We're going to be talking about it and we're going to be seeing… We have a lot of other things. I have tax cuts. We will be submitting in either the first or second package to Congress, the extension of the tax cuts, so that might very well be in there or it'll come sometime after that. Well, I commit. I mean, do things change? I think they change. I hate to go on shows… Like, Joe Biden, 'I'm not going to give my son a pardon. I will not under any circumstances give him a pardon.' I watched this and I always knew he was going to give him a pardon, and so I don't like putting myself in a position like that, so things do change, but I don't think it's going to change at all. We have two great people there. We have him and we have Pam. And Pam Bondi has been like a rocket ship. She's very popular and very good and very fair and Kash Patel is very fair. I'll tell you, I thought Kash may be difficult because he's a strong conservative voice and I don't know of anybody that's not singing his praises. The other day I was watching and Trey Gowdy, who's a moderate person and very smart and very respected in the party. He's Kash's biggest fan. He said, 'This is the most misunderstood man in politics. He's great.' I guess they work together on the Russia hoax or something, and Trey Gowdy became a fan. You know Trey Gowdy, everybody respects him and just like him, others also, I don't know of one negative vote. I don't think he's going to have any negative votes. I'm really looking to make our country successful. I'm not looking to go back into the past. I'm looking to make our country successful. Retribution will be through success. If we can make this country successful that would be my greatest… That would be such a great achievement. Bring it back. We have a country now that's overridden with crime, that has millions of people that shouldn't be here, that should be in prisons in other countries, that should be in mental institutions. We have drug lords being dropped into our country and told never go back to their country. I'm looking to make our country great. I'm looking to bring prices down because I want on two things, the border and more than immigration, they like to say immigration. I break it down more to the border, but I want on the border and I want on groceries. It's very simple word. Groceries, like almost… Who uses the word? I started using the word the groceries. When you buy apples, when you buy bacon, when you buy eggs, they would double and triple the price over a short period of time, and I won an election based on that. We're going to bring those prices way down. I will say this. No, I'm not doing that unless I find something that I think is reasonable, but that's not going to be my decision. That's going to be Pam Bondi's decision and to a different extent, Kash Patel, assuming they're both there and I think they're both going to get approved, but while you ask me that, what they've done to me with weaponization is a disgrace. You can't do one without the other. In the history of our country, nothing like this has ever happened and I've won these cases. I've won every one and the rest are in the process of being won. Deranged Jack Smith is on his way back to The Hague where he can execute people. This is where he should have stayed. I think he's dangerous even being there, but I'll tell you what, what they've done to me in terms of weaponization, indictments, impeachments and everything else, and in the end it probably helped me 'cause I got the biggest vote, the most votes any Republican's ever gotten in history. Well, I can't say I'm thrilled with him. He invaded my home. I'm suing the country over it. He invaded Mar-a-Lago. I'm very unhappy with the things he's done and crime is at an all time high. Migrants are pouring into the country that are from prisons and from mental institutions as we've discussed. I can't say I'm thrilled. Again, I don't want to be Joe Biden and give you an answer and then do the exact opposite- … so I'm not going to do that. What I'm going to say is I certainly cannot be happy with him. You take a look at what's happened and then when I was shot in the ear, he said, 'Oh, maybe it was shrapnel.' Where's the shrapnel coming from? Is it coming from heaven? I don't think so. So we need somebody to straighten up. I have a lot of respect for the FBI, but the FBI's respect has gone way down over the last number of years. No, no, no. I said some of it is. Some of it is very good. Some of it's very mainstream actually. Frankly, the Democrats should have used some of it because they went… With all the transgender that they were doing and with the men playing in women's sports, if they wouldn't have done that, maybe they would've done better. No. Some people, you take a look at the group, it was hundreds of people who were involved and I was actually… I reprimanded the whole group. I said, 'You shouldn't have placed this document in front of the voters because I have nothing to do with it and I'm the one that's running. You had no right to do this where you put a thousand-page document in front and many of those things I disagree with.' Now, many of those things I happen to agree with, many of those things Democrats should have agreed to, and I think they would've done much better in the election because they got slaughtered. I don't know how they voted. I don't know. I never spoke to them actually about it and I purposely, and I told you, normally it'd be just the opposite, I'd review every page. I purposely didn't even want to see it because when somebody like you asked me a question about Project 2025, I can honestly say I've never seen it, I have nothing to do with it. I didn't read it, but I did hear some things in there that I would totally disagree with. And I said to the people that were really the people behind it, you know who those people are. I said, 'You really had no right doing this to me,' because they used it as a sound bite, the Democrats, and I don't know, it couldn't have been too effective because they got slaughtered, but they did use it as a sound bite. Like law and order. We want law and order. Okay? Little things like let's put prisoners in jail. Let's not let people come out and raid every drug store in Manhattan so that we have to put glass up and every store is going out of business. I didn't do anything wrong. I was given the option and the lawyers told me, a very specific lawyer, I don't have to go into who, but very high up in the administration said, 'Sir, if you pardon yourself, you're going to look guilty and you did nothing wrong.' Oh, I had that option. I couldn't saved myself a lot of legal fees, but it turned out that I was right. Look at what's going on. Everything's being dropped. I still have a Fani Willis, Fani. A total hoax. That's a total hoax. It's all being dropped. It's all been discredited. It's been dropped. There are those people that say, and this would be the first time in history that though all of those fake indictments, they were going after a political opponent. There are those that say that I actually did better in the election because of it. Now that would be a first, I think you would agree because normally that's like you go back to the microphone, you say, 'I'm leaving right now. I will leave office. I'm going back to my family and I will fight for my name.' Well, I had to fight for my name in public because I didn't leave office, but no, I didn't want to pardon and I didn't want to pardon myself. I had the option to pardon myself. I've never even thought about it. I don't think he'll do it. Look, if he did, he's the one that started this whole thing. He got the Justice Department to go after me and the state cases are all being run by the Justice Department, which is illegal. They had their people from the Justice Department work for Alvin Bragg in order to get something going. They worked for Letitia James in the state. He had his people go from the federal government and take lesser jobs in the state in order to get it done. Because they were there. Wait a minute, wait. You have a tendency to sort of slough over things. You just made a statement. His person, the top, maybe the third or second or third person left the federal government, the DOJ, and went to work for Letitia James. And then after they got that one started, went to work for the DA. I can tell you this about Cheney, and she's a so-called Republican. I think she hurt the Democrats terribly. When I saw that Kamala put Cheney out on the campaign trail, I said, 'That's the end of Kamala.' I really did. I thought it was a terrible move, especially if you're a Democrat. But Cheney did something that's inexcusable along with Thompson and the people on the Unselect Committee of political thugs and creeps. So the Unselect Committee went through a year and a half of testimony. Wait, they deleted and destroyed all evidence that they found. You know why? Because Nancy Pelosi was guilty. Nancy Pelosi turned down 10,000 troops. You wouldn't have had a J-6 because other people were guilty. The people that said that I attacked two secret-service agents in a car, I grabbed one around the neck, I was then rebuffed and I grabbed the other one. These are two of the toughest men anywhere on the planet. They happened to be slightly younger than me. Just a little bit. Let me just tell you, they testified. They said it was total [inaudible 00:46:44], and all of this stuff came out. People lied so badly. Now listen, this was a committee, a big deal. They lied and what did they do? They deleted and destroyed a whole year and a half worth of testimony. Do you know that I can't get- I think those people committed a major crime. Biden can give them a pardon if he wants to and maybe he should. Just remember, Unselected Committee, a year and a half of sworn testimony and after getting all of the testimony, they deleted it. Wait, and they destroyed almost everything. There's nothing left. It's unprecedented. I wish you could be a… You have such potential. If you could be just non-biased. You hurt yourself so badly. I'm telling you, they deleted and destroyed all the evidence. Everyone knows it, and you slough it off like it doesn't mean anything. Listen, if I did it, you would be standing up in that chair shouting at me and you know what I'd do? I'd say, 'You got me.' They have done something so illegal. They have a committee sworn to and because it was so bad… The only reason they did it is because the testimony turned out to be in favor of me. Like, Secret Service testified and disputed everything. It made them into a bunch of liars. Not Secret Service, it made the people… They got rid of it because it made Nancy Pelosi, the Mayor of D.C., so many people look like criminals and I will tell you it's illegal for them to delete and to destroy that evidence. Those people have suffered long and hard. And there may be some exceptions to it. I have to look, but if somebody was radical, crazy, there might be some people from Antifa there. I don't know, because those people seem to be in good shape. Whatever happened to scaffold man, you know who scaffold man was? He stood on a scaffold telling everybody to go and nothing happened to him. Whatever happened to Ray Epps? Now, I don't know anything about Ray Epps, but it was sort of strange the way he was talking. Where is he? What happened to him? Because the people that did very little, they arrested an old woman because… I don't think she did anything. They don't even know what she did. These people have suffered, their lives have been destroyed. And yet in Portland, where they burned down half the city, they burn it down all the time, it's like a routine occurrence, they don't do anything. They attacked the courthouse, federal courthouse. They always say Federal building. Okay. They destroyed the beautiful limestone exterior in the courthouse in Portland. They killed people in Portland. Seattle, people got killed in Seattle. Seattle, they took over a big chunk of the city. They took it over. They took the city away. Minneapolis, it looked like when they said this is a friendly protest, and yet over the poor slob from CNN, his shoulder, the entire city was burning down. It looked like World War II. Nothing happened. Wait, nothing happened. They took over the police station in Minneapolis. They burned it down. Nothing happened to anybody. And yet these people have been in jail, and I hear that jail is a hell hole. They've done reports, and you would say that's true. They've done reports, this is the most disgusting, filthy place these people are living in hell. Listen, it's a very tough system. Do you know almost nobody… I saw people that didn't even go into the building and they were convicted and you had the police saying, 'Come on in, come on in.' I mean, the police are saying, 'Come on in, everybody come on in.' They had people… You have a lot of cameras. They don't want to release the tapes. They don't want to release the tapes. But I've spoken to people that know him very well and they say he does not have a drinking problem and he had a lot of knives out for him. A lot of people don't want to see the military made better. I met with Putin. I met with President Xi of China. I met with Kim Jong-un twice. Does that mean that I can't be president? Look, people meet. All these people meet. I mean, I see some of the most dishonest people. I'll tell you, the 51 agents that said that the laptop wasn't from Hunter, it was from Russia. What about them? Tell me about them. Do you think they did something wrong? Do you think they were all al so stupid that they thought that the laptop from hell. When you look at some of the problems, when you look at what's going on with disease and sickness in our country, something's wrong. Well, if you take a look at autism, you go back 25 years, autism was almost nonexistent, was one out of a hundred thousand, and now it's close to one out of a hundred. I mean, what's happening? If they can find it. Now, I did something the other night that was a little unusual. At Mar-a-Largo, I called the drug companies, the top drug companies, and I called RFK Junior and Dr. Oz and some of his people, and I said, 'Let's all get together and let's figure out where we're going,' because we're going to do a lot of things. Number one, we're going to reduce prices because the middleman makes more money than the drug companies, in all fairness to the drug companies, there's a middleman that nobody even knows who they are. And you look at our drug prices, they're much higher than the prices for the same medicine for the same stuff. So we met and we met for a long time and we talked about pricing and we talked about vaccines in terms of what happens. We talked about pesticides, we talked about everything. And I think a lot of good things are going to come from him. And he's not going to upset any system. He's not going to upset the system. He's not looking to reinvent the wheel totally, but when you look at the numbers, we really don't have a very healthy country. I'm open to anything. I think somebody has to find out. If you go back 25 years ago, you had very little autism. Now you have it- One in 100,000, and now it's one in 100. That's a pretty bad number. I mean, something is going on. I don't know if it's vaccines. Maybe it's chlorine in the water. People are looking at a lot of different things. I'm all for it. I think it's great. Hey, look, I'm not against vaccines. The polio vaccine is the greatest thing. If somebody told me get rid of the polio vaccine, they're going to have to work real hard to convince me. I think vaccines are… Certain vaccines are incredible, but maybe some aren't. And if they aren't, we have to find out. But when you talk about autism, because it was brought up, and you look at the amount we have today versus 20 or 25 years ago, it's pretty scary. No. Jeff Bezos called me. We're having dinner. As you know, mark Zuckerberg came in. We had a really nice dinner. He asked to have dinner, I had dinner with him. I'm having dinner with everybody, people like me now. It's something going on. I said, 'Would you have come to dinner with me if I lost? I think the answer is no.' I said it nicely, kidding, of course, because I don't want to sound foolish, but I say jokingly, 'Would you have been here at dinner if I lost?' And the answer was probably not. Look, I'm getting called by everybody. It's very interesting. It's different than the first. When I won the first time, I wasn't nearly as popular as this. And one thing that's very important in terms of the election, I love that I won the popular vote and by a lot. If I didn't- … because they would go with the other one. They say, 'While he didn't win the popular vote, he won a lot…' I won a lot of the electoral college. But they would always preface it by saying, now they say, 'He won the popular vote and he won the electoral college and he won all seven swing states.' That was a great election. No, I said to people, 'We're not touching Social Security, other than we might make it more efficient, but the people are going to get what they're getting. We're in for 350 billion. And Europe is in for 100 billion. Why isn't Europe in for the same as us? The one thing that should happen is that Europe should come in for … They should equalize. And Biden, all he had to do, like I did with NATO, I said, 'You've got to pay your bills.' They weren't paying their bills. And as you know, the secretary general said President Trump got $600 billion, 640 to be exact. And I used to use the 400 billion number. He corrected me. He said, 'No, you actually got $641 billion put in' because I said, 'You have to pay your bills.' We were paying for NATO. And you know why I got the money? Because I asked for it. It wasn't that complicated. Europe is in for a fraction. And war with Russia is more important for Europe than it is for us. It's important for everybody, but it's more important for Europe than it is for us. We have a little thing called an ocean in between us. There are people being killed in that war at levels that nobody's ever seen before. You have to go back to the Second World War, and even that, if you take a look. And you know what it is? It's the soldiers largely. The cities have been emptied out and demolished. The country has been demolished. If I won that election, which you know how I feel about it. I won't get into it 'cause we don't need to start that argument. I think it's an easy argument. It was really proven even more conclusively by the win that I had on this one. Yeah, well, that's your opinion. But I disagree with it. Had I assumed, kept control, number one, Israel wouldn't have happened, number two, Ukraine would've never happened. It would've never happened, Ukraine, Russia. But the number of people that are being killed, soldiers, young, beautiful soldiers, hundreds of thousands of people are being killed. And it's very interesting. It's level. Totally level, the battlefields. Totally level. You know what's happening? The only thing that stops a bullet, you know what it is? Is a body, a human body. And the people that are being killed, hundreds of thousands on both sides. Russia's lost probably 500,000. Ukraine's lost higher than they say, probably 400, 000. You're talking about hundreds of thousands of bodies laying all over the fields. It's the stupidest thing I've ever seen, and it should've never been allowed to happen. Biden should've been able to stop it. But NATO's taking advantage of us because we were … Look, two things. Number one, they take advantage of us on trade, meaning the European nations, okay, like terrible. They don't take our cars, they don't take our food product, they don't take anything. It's a disgrace. And on top of that, we defend them. So it's a double-whammy. So let me just tell you. I was able to get hundreds of billions of dollars put into NATO just by a tough attitude. I said to the countries, 'I'm not going to protect you unless you pay,' and they started paying. And that amounted to more than $600 billion. That's a big thing. Otherwise, they wouldn't even be fighting. They wouldn't have any money to fight. If they're paying their bills, and if I think they're doing a fair, they're treating us fairly, the answer is absolutely I'd stay with NATO. I'm not a big believer in the fact that there are too many of them living, sadly. Because I've seen the way they've been treated. I talk about the young girl that was pulled by her hair violently and thrown into the back of a car like she was a sack of potatoes. And I said, 'You know, that's hatred.' And then I said, 'How did that young girl do?' Beautiful young girl, just dragged by her hair. You remember. Blood pouring all over her body. You can imagine the parents. Thrown into the back of a car by some horrible guy. And I said, 'How is she?' 'She's dead. She died, sir.' I don't think you have as many. I mean, I hate to say it, I think you have far fewer hostages than people think. I want him to end it, but you have to have a victory. People forget about October 7th. That was as violent … And you know what's happening? I noticed that a lot of people are saying, 'Oh, it never really happened.' That's like the Holocaust. You know, you have Holocaust deniers. Now you have October 7th deniers, and it just happened. No, October 7th happened. And I've seen the pictures. What happened is horrible. … I used TikTok very successfully in my campaign. I have a man named TikTok Jack, he was very effective, obviously, because I won youth by 30%. All Republicans lose youth. I don't know why. Maybe it's changing. And last time we were down 30% with youth. This time we were up 35% with youth. And I used TikTok, so I can't really, you know, I can't totally hate it. It was very effective. But I will say this, if you do do that, something else is going to come along and take its place. And maybe that's not fair. And really, what the judge actually said was that you can't have Chinese companies. In other words, they have the right to ban it if you can prove that Chinese companies own it. That's what the judge actually said. I'm going to try and make it so that other companies don't become an even bigger monopoly. No, no. I'm not the president. So when you say it's deeply divided, I agree. But Biden's the president, I'm not. And he has been a divider. And you know where he divided it more than anything else, and it probably backfired on him? I think definitely is weaponization. When he weaponized the Justice Department and he went after his political opponent, me. He went after his political opponent violently because he knew he couldn't beat him. And I think it really was a bad thing, and it really divided our country. I'm not interested. I have the absolute right. I'm the chief law enforcement officer, you do know that. I'm the president. But I'm not interested in that. You know what I'm interested in? Drilling, and getting prices down, and stopping people from pouring into our border that come from prisons and mental institutions. I have confidence in Secret Service. I know the people. I got to know a lot of them, and I have confidence. It was a bad moment. Something shouldn't have happened. But I have a lot of confidence, and they really stepped it up. They were restricted from giving the … Look, I do a rally, and you were at many of them. And I'd have 50,000 people. Joe would have a rally and he'd have 30 people. And he had more Secret Service than me. My Secret Service was always asking for more manpower/woman power. They were asking for more and more, and more, and they couldn't get it. I'm not blaming them really, because they were always fighting for more people. And they wouldn't get … Now, boy, do we have it. She's very liked, loved, and she's very respected, and she's a very solid person. And she devotes a lot of time to helping children. You know what she does. And she's got her Be Best deal that is incredible what she has done. The one thing I say, whether it's the first lady or my children, my children did such a good job and they were treated very badly by the press and others. Ivanka was unbelievable, what she did. All she wanted to do was one thing, get people jobs. She could've been the UN secretary. I said to her she would've been unbelievable. She's got the whole package for that, including right up there. She's as smart as they … She didn't want it. She said, 'Daddy, I want to work on getting people jobs.' You know, she'd go to Walmart, she'd go to Exxon. She produced millions of jobs for people. Not glamorous. Most people didn't know she did it. And she was always being excoriated. And I said to my kids, 'Don't come in. Don't come in. It's just- I'll tell you what, I'll miss them, and they are really competent. But I say, 'Just go have fun, do your business, do whatever you want to do. But don't come in.' Because no matter what they did, they did such a great job. Although I have to say, Lara did a phenomenal job as the head of the Republican National Committee, along with Michael. She's a very elegant First Lady. She was a very successful woman before that in the modeling and other things, but in the modeling, very successful. The press I can't say treated her unfairly. You know why? Because she's very popular. You would think if the press was unfair, like to me the press was obviously unfair to me, the press … No president has ever gotten treated by the press like I was. And yet I got more votes than any Republican candidate in history by far. It's not even close. So you say what's that all about? The press has to straighten itself out, because honestly it's lost all credibility. When that can happen, based on the press I should've gotten no votes, none. And yet I got the highest number ever. And the reason is 'cause I'm able to go on a show even like yours, even though you're very hostile, I'm able to go on a show like yours. No, you are. I've seen George Stephanopoulos interview Biden, and he's a tough interviewer. It's the softest interview. I've seen CNN interview him. They give these soft, 'What's your favorite ice cream?' It's a whole different deal. I don't understand why. You would think the press would like to see strong borders, great education, a powerful military so we have a country left, and all these different things. And somehow they don't want to see that. I'm going to treat you every bit as well as I have treated the greatest MAGA supporters. There's never been anything like MAGA in the history of this country. These people are so dedicated to making America great again. It's very simple. And I'm going to treat them just the same as I treat MAGA. We're going to treat everybody good. We want success for our country. We want safety for our country. You know our country's under threat, as you know. We have tremendous threat militarily because of the power of weapons and weaponry. There's tremendous threat. Nobody talks about it, but it's tremendous threat. I want to treat everybody the same. I want to treat them well. And at the end of this four years, and I have a big head start, because I was there for four years fairly recently. A lot of bad things were done during the four years that I wasn't there. And mostly and what they've done in terms of our reputation overseas, our reputation is so bad, so shot. I got to bring it back, and I also have to, I have to bring back civilization to our country. Our country is a crime pod and we have to get rid of crime. We have so many things to do. We have to do the prices. We have to do all of that. But we have to get the criminals out of our country. We have to bring down crime. People have to be able to walk across the street and buy a loaf of bread without being shot. And that's going to happen. But what I say to them is I love you, and we're going to all work together. And we're going to bring it together. And you know what's going to bring it together? Success. I saw that just prior to COVID coming in, I had polls that were the highest anyone … McLaughlin and Fabrizio said, 'George Washington and Abraham Lincoln, if they came back from the dead and they ran as president and vice president, couldn't beat you, sir.' We were doing so well. And I was getting along with the left. Let's call it the left. We'll be nice, okay? We're just going to call it, but I was getting along with people that you would consider liberal or progressive, as they like to say, at levels that I never thought was possible. And you know what it was? Success. Success was bringing the country together, and that's what I want to do. \n"
        }
    ]
}