{
  "authors": ["Kamala Harris"],
  "date": "2024-10-30",
  "context": "",
  "content": [{"author": "Kamala Harris", "content": "{
  "authors": ["Kamala Harris"],
  "date": "2024-10-30",
  "context": "Last campaign remarks at the ellipse in Washington DC",
  "content": [{"author": "Kamala Harris", "content": "Good evening. One week from today, you will have the chance to make a decision that directly impact your life, the life of your family, and the future of this country we love. It will probably be the most important vote you ever cast. And this election is more than a choice between two parties and two different candidates. It is a choice about whether we have a country rooted in freedom for every American. Or one ruled by chaos and division. Many of you watching have probably already cast your ballots. But I know many others are still considering who to vote for – or whether you’ll vote at all. So tonight, I will speak to everyone about the choice and stakes in this election. Look, we all know who Donald Trump is. He is the person who stood at this very spot nearly four years ago and sent an armed mob to the United States Capitol to overturn the will of the people in a free and fair election that he knew he lost. Americans died as a result of that attack. 140 law enforcement officers were injured. And while Donald Trump sat in the White House watching, as the violence unfolded on television, he was told by staff that the mob wanted to kill his own vice president. Donald Trump responded with two words: “So what?” That’s who Donald Trump is. And that is who is asking you to give him another four years in the Oval Office. Not to focus on your problems. But to focus on his. And Donald Trump has told us his priorities for a second term. He has an Enemies List of people he intends to prosecute. He says one of his highest priorities is to set free the violent extremists who assaulted those law enforcement officers on January 6th. Donald Trump intends to use the United States military against American citizens who simply disagree with him. People he calls—quote—“the enemy from within.” This is not a candidate for President who is thinking about how to make your life better. This is someone who is unstable, obsessed with revenge, consumed with grievance, and out for unchecked power. Donald Trump has spent a decade trying to keep the American people divided and afraid of each other. That’s who he is. But America, I am here tonight to say: that’s not who we are. You see, what Donald Trump has never understood is that E Pluribus Unum—out of many, one—isn’t just a phrase on a dollar bill. It is a living truth at the heart of our nation. Our democracy doesn’t require us to agree on everything. That’s not the American way. Just the opposite. We don’t shy away from robust debate. We like a good debate. And the fact that someone disagrees with us, does not make them “the enemy from within.” They are family. Neighbors. Classmates. Coworkers. They are fellow Americans. And as Americans, we rise and fall together. America, for too long, we have been consumed with too much division, chaos, and mutual distrust. And it can be easy to forget a simple truth: it doesn’t have to be this way. It is time to stop pointing fingers and start locking arms. It is time to turn the page on the drama and conflict, the fear and division. It is time for a new generation of leadership in America. And I am ready to offer that leadership as the next President of the United States. Look, I recognize this has not been a typical campaign. And even though I’ve had the honor of serving as your Vice President for the last four years, I know many of you are still getting to know who I am. Well–I am someone who has spent most of my career outside of Washington. So I know that not all good ideas come from here. I am not afraid of tough fights against bad actors and powerful interests. Because for decades, as a prosecutor and as the top law enforcement officer of our biggest state, I won fights: against big banks that ripped off homeowners, against for-profit colleges that scammed veterans and students, against predators who abused women and children, and cartels that trafficked in guns, drugs, and human beings. I did this work because, for as long as I can remember, I have always had an instinct to protect. There’s something about people being treated unfairly, or overlooked, that just gets to me. It is what my mother instilled in me—a drive to hold accountable those who use their wealth or power to take advantage of other people. The drive to protect hard-working Americans who aren’t always seen or heard, and deserve a voice. That is the kind of president I will be. And look, I’ll be honest with you: I’m not perfect. I make mistakes. But here’s what I promise you: I will always listen to you, even if you don’t vote for me. I will always tell you the truth, even if it’s hard to hear. I will work every day to build consensus and reach compromise to get things done. And if you give me the chance to fight on your behalf, there is nothing in the world that will stand in my way. In less than 90 days, either Donald Trump or I will be in the Oval Office. On Day One, if elected, Donald Trump would walk into that office with an Enemies List. When elected, I will walk in, with a To-Do list. Full of priorities on what I will get done for the American people. And I will work with everyone —Democrats, Republicans, and Independents—to help Americans who are working hard and still struggling to get ahead. I have been honored to serve as Joe Biden’s Vice President. But I will bring my own experiences and ideas to the Oval Office. My presidency will be different because the challenges we face are different. Our top priority as a nation four years ago was to end the pandemic and rescue the economy. Now our biggest challenge is to lower costs, costs that were rising even before the pandemic, and that are still too high. I get it. I still remember my mother sitting at that yellow Formica table late at night, cup of tea in hand, a pile of bills in front of her, trying to make it all work. And I’ve heard from so many of you who are facing even greater financial pressures. Donald Trump’s answer to you is the same as before: another trillion dollars in tax cuts for billionaires and big corporations. And this time, he will pay for it with a 20% national sales tax on everything you buy that is imported – clothes, food, toys, cell phones. A Trump Sales Tax that would cost the average family nearly four thousand a year. And on top of that, you will pay even more if Donald Trump finally gets his way and repeals the Affordable Care Act, which will throw tens of millions of Americans off their health insurance, and take us back to when insurance companies had the power to deny people with pre-existing conditions. Well, we are not going back. Donald Trump will deliver tax cuts to his billionaire donors. I will deliver tax cuts to working people and the middle class. I will make sure you have a chance to not just get by, but get ahead.  Because I believe in honoring the dignity of work. I will enact the first-ever federal ban on price gouging on groceries, cap the price of insulin, and limit out-of-pocket prescription costs for all Americans. I will fight to make sure that hard working Americans can actually afford a place to live. I will never forget how my mother saved up—and how excited she was—when she could finally afford to buy our first home. And I know that owning a home is not only a measure of financial security. It’s about the pride of hard work. And as President, I will fight to help first-time home buyers with your down payment, take on companies that are jacking up rents, and build millions of new homes. For years, we have heard excuses about why America can’t build enough housing. Enough with the excuses. I’m going to cut red tape and work with the private sector and local governments to speed up building and get it done. And the cost of housing isn’t the only financial pressure on middle class families. I have met so many young people who have a natural desire to parent well, but not always the resources to do it. So I’ll fight for a child tax credit to save them some money, which will also lift American children out of poverty. I’ll work to lower the cost of child care, which is out of reach for too many working families today. And for too many people, including those in the sandwich generation, who are raising young children and taking care of a parent, juggling it all is difficult. I took care of my mother when she got sick, cooking foods she had a taste for, finding clothes that wouldn’t irritate her skin. I understand that caregiving is about dignity. Currently, if you need home care, and you don’t have the money to hire someone, you and your family need to deplete your savings to qualify for help. So, we’re going to change the approach. And allow Medicare to cover the cost of home care. So seniors can get the help and care they need in their own homes. Donald Trump has a different approach. He tried to cut Medicare and Social Security every year he was president. I believe when people have worked hard their entire life, they deserve to retire with the benefits they have earned.  And I believe in the fundamental freedom of Americans to make decisions about their own bodies. And not have their government tell them what to do. I will fight to restore what Donald Trump and his hand-picked Supreme Court Justices took away from the women of America.  That today, 1 in 3 women in America lives in a state with a Trump abortion ban, many with no exceptions even for rape and incest. The idea that a woman who survives a crime of a violation to her body would be told she does not have the authority to decide what happens to her body next is immoral. And Trump isn’t done. He would ban abortion nationwide, restrict access to birth control and put IVF at risk, and force states to monitor women’s pregnancies. Just Google Project 2025. Read the plans for yourself. And one does not have to abandon their faith or deeply held beliefs to agree that the government and Donald Trump should not be telling a woman what to do with her body. And when Congress passes a bill to restore reproductive freedom nationwide, as President of the United States, I will proudly sign it into law. And politicians must stop treating immigration as an issue to scare up votes in an election. And instead, treat it as a serious challenge that we must finally come together and solve.  I will work with Democrats and Republicans to sign into law the border security bill that Donald Trump killed. When I was Attorney General of a border state, I saw the chaos and violence, caused by the transnational criminal organizations that I took on. And when I am President, we will quickly remove those who arrive here unlawfully, prosecute the cartels, and give border patrol the support they so desperately need. At the same time, we must acknowledge, we are a nation of immigrants. And I will work with Congress to pass immigration reform, including an earned path to citizenship for hardworking immigrants like farmworkers and Dreamers. As Commander in Chief, I will make sure America always has the strongest, most lethal fighting force in the world. Donald Trump, on the other hand, has shown his contempt for our nation’s heroes. Calls them “suckers” and “losers.” Called a 4 star Marine General, a—quote—“lowlife.” I, will always honor—never denigrate—the service and sacrifice of our troops and their families. And fulfill our sacred obligation to care for them. I will strengthen. Not surrender. America’s global leadership. And I will stand with our friends. Because I know that our alliances keep the American people safe, and make America stronger and more secure. World leaders think that Donald Trump is an easy mark. Easy to manipulate with flattery and favor. And you can believe that autocrats like Putin and Kim Jong Un are rooting for him in this election.  I will always uphold our security, advance our interests, and ensure that the United States of America remains, as we must forever be—a champion of liberty around the world.  America, we know what Donald Trump has in mind. More chaos. More division. And policies that help those at the very top and hurt everyone else. I offer a different path. And I ask for your vote. And here is my pledge to you: I pledge to seek common ground and common sense solutions to make your lives better. I am not looking to score political points. I am looking to make progress. I pledge to listen: To experts, to those who will be impacted by the decisions I make, and to people who disagree with me. Unlike Donald Trump, I don’t believe people who disagree with me are the enemy. He wants to put them in jail. I’ll give them a seat at the table. I pledge to approach my work with the joy and optimism that comes from making a difference in people’s lives. And I pledge to be a President for all Americans. To always put country above party and above self. I love our country with all my heart. And, I believe in its promise. Because I’ve lived it. I grew up as a child of the Civil Rights Movement. My parents would take me to marches in a stroller, where crowds of people, of all races, faiths, and walks of life, came together to fight for the ideals of freedom and opportunity. I’ve lived the Promise of America. I saw how hard my mother worked to give her daughters the same chances this country gave her. Growing up, I was blessed to have family by blood and family by love who instilled in me the values of community, compassion, and faith that have always defined our nation at its best. I’ve lived the Promise of America. I’ve spent my life fighting for the people who have been hurt and counted out, but never stopped believing that, in our country, anything is possible. I’ve lived the Promise of America. And I see the Promise of America in all of you. In the young people voting for the first time. Who are determined to live free from gun violence, protect our planet, and shape the world they inherit. In the women who refuse to accept a future without reproductive freedom. And the men who support them. In Republicans, who never voted for a Democrat before, but put the  Constitution of the United States over party. In Americans, different in many respects, but united in: Our pursuit of freedom. Our belief in fairness and decency. And our faith in a better future. America: I know that the vast majority of us have so much more in common than what separates us. That’s why I’m in this race. To fight for The People. Just like I always have. Nearly 250 years ago, America was born when we wrested freedom from a petty tyrant. Across the generations, Americans have: Preserved that freedom. Expanded it. And in so doing, proved to the world that a government of, by, and for the people is strong and can endure. And those who came before us – the patriots at Normandy and Selma. Seneca Falls and Stonewall. On farmlands and factory floors. They did not struggle, sacrifice, and lay down their lives, only to see us cede our fundamental freedoms, only to see us submit to the will of another petty tyrant. The United States of America is not a vessel for the schemes of wannabe dictators. The United States of America is the greatest idea humanity ever devised. A nation big enough to encompass all our dreams. Strong enough to withstand any fracture or fissure between us. And fearless enough to imagine a future of possibilities. So, America, let us reach for that future. Let us fight for this beautiful country we love. And in 7 days, we have the power to turn the page, and start writing the next chapter in the most extraordinary story ever told. Thank you. God bless you. And may God bless America.

"}]
}"}]
}